20240919170506-portfolio_2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-29 Sun 23:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Portfolio 2</title>
<meta name="author" content="chameko" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="imagine.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Portfolio 2</h1>
<p>
Biology is hard. Research is also very hard, especially in subjects that you aren't familiar with. A lot of research and knowledge comes down to knowing what the right questions to ask are and where to find the information. However this creates a barrier of entry for any field your not familiar with as its requires you to know that key term that describes exactly what your looking for. It also cascades, to understand A you need to understand B and C and to understand B and C you need to know about D and E and so on. While researching, one of the first things I wanted to get a proper grasp of was what exactly <i>is</i> spatial transcriptomics? The machine learning model I'm developing will become a method for this class of techniques but <i>why is it important</i> and what <i>exactly</i> does it do? My Mum called biology the study of long words because while it can be complex it can also be deceptively simple, simply surrounded in a sea of unpronounceable jargon (Deoxyribonucleic acid anyone?)
</p>

<p>
To start my research I opened the paper that my work will be based on and searched for where they talked about spatial transcriptomics and then followed the links. This for me personally is one of the best ways to get started as papers usually have multiple citations that lead to more papers with more citations and it allows you to collect a wide net of differing articles until you get low enough to one you understand. However I didn't find the articles incredibly helpful, the best one being <a href="https://www.nature.com/articles/s41592-020-01033-y#Sec7">https://www.nature.com/articles/s41592-020-01033-y#Sec7</a> which helped, but frankly reads like 50 quotes strung together, none of which form a cohesive image.
</p>

<p>
So I simply googled around for a bit and fortunately found this excellent article <a href="https://genomemedicine.biomedcentral.com/articles/10.1186/s13073-022-01075-1">https://genomemedicine.biomedcentral.com/articles/10.1186/s13073-022-01075-1</a>. This article single handily saved my <del>life</del> research. It not only provides a solid background that starts off simple enough for me to learn, but also describes <b>WHY</b> its important. It also goes in-depth about the current techniques, which is a bit too complicated for me now, but I would like to look more into so I can compare my machine learning techniques to them later.
</p>

<p>
Right now I'm learning more about the area of my subject and I feel like my research skills have improved, especially when it comes to reading and understanding scholarly articles. Learning to utilise their references has really improved my speed. I'm on track with the plan and should finish up this research in a couple of weeks.
</p>
</div>
<div id="postamble" class="status">
<p class="author">Author: chameko</p>
<p class="date">Created: 2024-09-29 Sun 23:33</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
